The first where returns records from the previous seven days only
The second where filters on FileName to search for process file names representing the PowerShell application
The third where filters on strings in command lines that are typically used to download files using PowerShell
project returns the specified columns only
top limits the number of results to 100
Advanced hunting is based on the Kusto query language. The following operators are allowed:

where. Filter a table to the subset of rows that satisfy a predicate.
summarize. Produce a table that aggregates the content of the input table.
join Merge the rows of two tables to form a new table by matching values of the specified column(s) from each table.
count. Return the number of records in the input record set.
top. Return the first N records sorted by the specified columns.
limit. Return up to the specified number of rows.
project. Select the columns to include, rename or drop, and insert new computed columns.
extend. Create calculated columns and append them to the result set.
makeset(). Return a dynamic (JSON) array of the set of distinct values that Expr takes in the group.
find. Find rows that match a predicate across a set of tables.
Best practices

finds poer shell execution evcents that could invole a download

// Finds PowerShell execution events that could involve a download
union DeviceProcessEvents, DeviceNetworkEvents
| where Timestamp > ago(7d)
// Pivoting on PowerShell processes
| where FileName in~ ("powershell.exe", "powershell_ise.exe")
// Suspicious commands
| where ProcessCommandLine has_any("WebClient",
"DownloadFile",
"DownloadData",
"DownloadString",
"WebRequest",
"Shellcode",
"http",
"https")
| project Timestamp, DeviceName, Initiating ProcessFileName, Initiating ProcessCommandLine, FileName, ProcessCommandLine, RemoteIP, RemoteUrl, Remote Port, RemoteIPType
top 100 by Timestamp

                                                                  Behavior-based detections
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Behavior-based detections are named according to the MITRE ATT&CK Matrix for Enterprise. The naming convention helps identify the attack stage where malicious behavior was observed:

Tactic	Detection threat name
Initial Access	Behavior:Win32/InitialAccess.*!ml
Execution	Behavior:Win32/Execution.*!ml
Persistence	Behavior:Win32/Persistence.*!ml
Privilege Escalation	Behavior:Win32/PrivilegeEscalation.*!ml
Defense Evasion	Behavior:Win32/DefenseEvasion.*!ml
Credential Access	Behavior:Win32/CredentialAccess.*!ml
Discovery	Behavior:Win32/Discovery.*!ml
Lateral Movement	Behavior:Win32/LateralMovement.*!ml
Collection	Behavior:Win32/Collection.*!ml
Command and Control	Behavior:Win32/CommandAndControl.*!ml
Exfiltration	Behavior:Win32/Exfiltration.*!ml
Impact	Behavior:Win32/Impact.*!ml
Uncategorized	Win32/Generic.*!ml

